---
kind: property
id: P:Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.SegmentLengthDimensionsOffset
source: html/2c4470fa-1594-ce4f-93a6-8ed868c4bad7.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.SegmentLengthDimensionsOffset Property

Identifies the offset of the segment length dimensions.

## Syntax (C#)
```csharp
public double SegmentLengthDimensionsOffset { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for segmentLengthDimensionsOffset must be between 0 and 30000 feet.